<a href="https://colab.research.google.com/github/learn-programmers/programmers_kdt_II/blob/main/9%EC%A3%BC%EC%B0%A8_SQL_%EC%8B%A4%EC%8A%B5_3%EC%9D%BC%EC%B0%A8_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [ ]:
%load_ext sql

In [ ]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1!*@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@prod'

다양한 SELECT 실행해보기

In [ ]:
%%sql

SELECT * FROM raw_data.session_timestamp LIMIT 10

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[('c41dd99a69df04044aa4e33ece9c9249', datetime.datetime(2019, 5, 1, 0, 35, 59, 897000)),
 ('fdc0eb412a84fa549afe68373d9087e9', datetime.datetime(2019, 5, 1, 2, 53, 48, 503000)),
 ('0a54b19a13b6712dc04d1b49215423d8', datetime.datetime(2019, 5, 1, 12, 18, 26, 637000)),
 ('a914ecef9c12ffdb9bede64bb703d877', datetime.datetime(2019, 5, 1, 13, 41, 29, 267000)),
 ('05ae14d7ae387b93370d142d82220f1b', datetime.datetime(2019, 5, 1, 14, 17, 54, 83000)),
 ('eddeb82df22554fa67c641e3f8a25566', datetime.datetime(2019, 5, 1, 14, 42, 50, 487000)),
 ('4c4ea5258ef3fb3fb1fc48fee9b4408c', datetime.datetime(2019, 5, 1, 15, 8, 15, 557000)),
 ('8ae1da0fe37c98412768453f82490da2', datetime.datetime(2019, 5, 1, 15, 20, 27, 377000)),
 ('60131a2a3f223dc8f4753bcc5771660c', datetime.datetime(2019, 5, 1, 15, 53, 7, 17000)),
 ('90f4760fcc9b69c13da7368c5c2917f3', datetime.datetime(2019, 5, 1, 16, 15, 43, 423000))]

In [ ]:
%%sql

SELECT DATE(ts) date, sessionID FROM raw_data.session_timestamp LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), '7cdace91c487558e27ce54df7cdb299c'),
 (datetime.date(2019, 5, 1), '94f192dee566b018e0acf31e1f99a2d9'),
 (datetime.date(2019, 5, 1), '7ed2d3454c5eea71148b11d0c25104ff'),
 (datetime.date(2019, 5, 1), 'f1daf122cde863010844459363cd31db'),
 (datetime.date(2019, 5, 1), 'fd0efcca272f704a760c3b61dcc70fd0'),
 (datetime.date(2019, 5, 1), '8804f94e16ba5b680e239a554a08f7d2'),
 (datetime.date(2019, 5, 1), 'c5f441cd5f43eb2f2c024e1f8b5d00cd'),
 (datetime.date(2019, 5, 1), 'd5fcc35c94879a4afad61cacca56192c'),
 (datetime.date(2019, 5, 1), '3d191ef6e236bd1b9bdb9ff4743c47fe'),
 (datetime.date(2019, 5, 1), 'c17028c9b6e0c5deaad29665d582284a')]

In [ ]:
%%sql

SELECT DATE(ts) date, sessionID FROM raw_data.session_timestamp ORDER BY ts 
desc LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 10), 176),
 (datetime.date(2019, 5, 12), 171),
 (datetime.date(2019, 5, 13), 178)]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [ ]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 119),
 (datetime.date(2019, 5, 2), 127),
 (datetime.date(2019, 5, 3), 130),
 (datetime.date(2019, 5, 4), 122),
 (datetime.date(2019, 5, 5), 124),
 (datetime.date(2019, 5, 6), 133),
 (datetime.date(2019, 5, 7), 147),
 (datetime.date(2019, 5, 8), 135),
 (datetime.date(2019, 5, 9), 145),
 (datetime.date(2019, 5, 10), 144)]

In [ ]:
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [ ]:
%%sql

SELECT COUNT(1) FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(67768,)]

판다스와 연동하는 방법

In [ ]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
101520 rows affected.

In [ ]:
df.head()

   userid                         sessionid   channel
0     184  c41dd99a69df04044aa4e33ece9c9249     Naver
1      80  fdc0eb412a84fa549afe68373d9087e9   Organic
2     251  0a54b19a13b6712dc04d1b49215423d8  Facebook
3     264  a914ecef9c12ffdb9bede64bb703d877    Google
4     744  05ae14d7ae387b93370d142d82220f1b  Facebook

In [ ]:
df.groupby(["channel"]).size()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
dtype: int64

In [ ]:
df.groupby(["channel"])["sessionid"].count()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
Name: sessionid, dtype: int64

In [ ]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
101520 rows affected.

In [ ]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [ ]:
df_st.head()

                          sessionid                      ts        date
0  7cdace91c487558e27ce54df7cdb299c 2019-05-01 00:13:11.783  2019-05-01
1  94f192dee566b018e0acf31e1f99a2d9 2019-05-01 00:49:46.073  2019-05-01
2  7ed2d3454c5eea71148b11d0c25104ff 2019-05-01 10:18:43.210  2019-05-01
3  f1daf122cde863010844459363cd31db 2019-05-01 13:10:56.413  2019-05-01
4  fd0efcca272f704a760c3b61dcc70fd0 2019-05-01 13:45:19.793  2019-05-01

In [ ]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

date
2019-05-01    147
2019-05-02    161
2019-05-03    150
2019-05-04    142
2019-05-05    144
             ...
2019-11-26    633
2019-11-27    617
2019-11-28    516
2019-11-29    531
2019-11-30    562
Length: 214, dtype: int64

In [ ]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)

           date  count
213  2019-11-30    562
212  2019-11-29    531
211  2019-11-28    516
210  2019-11-27    617
209  2019-11-26    633
..          ...    ...
4    2019-05-05    144
3    2019-05-04    142
2    2019-05-03    150
1    2019-05-02    161
0    2019-05-01    147

[214 rows x 2 columns]